?- scalar_product([1, 2, 3], [4, 5, 6], Product).
Product = 32.

?- scalar_product([1, 2], [3, 4, 5], Product).
Product = 11.

?- scalar_product([1, 2, 3], [4, 5], Product).
Product = 14.

?- scalar_product([], [1, 2, 3], Product).
Product = 0.

?- scalar_product([1, 2, 3], [], Product).
Product = 0.